In [1]:
import etl_utils as eu
import os
import pandas as pd

In [2]:
DATAPATH = r"..\data\traditional_data\prod_ready"

In [3]:
csv_files = eu.get_csv_files(DATAPATH)
csv_files = csv_files[3:]

In [4]:
encoding = eu.encoding_detect(csv_files[0])
delimeter = eu.detect_delimiter(csv_files[0])

data = pd.read_csv(csv_files[0], encoding=encoding, delimiter=delimeter)

In [5]:
data = eu.transform_to_date(data)

In [6]:
quarter = eu.transform_to_quarterly(data)
quarter

               CANA
DATE
1990-01-01  37519.5
1990-04-01  37640.1
1990-07-01  37677.8
1990-10-01  37655.5
1991-01-01  37444.1
...             ...
2022-01-01  52385.7
2022-04-01  52965.2
2022-07-01  53343.7
2022-10-01  53629.3
2023-01-01  53864.2

[133 rows x 1 columns]

In [7]:
quarter.query("index >= '2005-01-01'")

               CANA
DATE
2005-01-01  44721.5
2005-04-01  44969.5
2005-07-01  45296.4
2005-10-01  45554.0
2006-01-01  45725.3
...             ...
2022-01-01  52385.7
2022-04-01  52965.2
2022-07-01  53343.7
2022-10-01  53629.3
2023-01-01  53864.2

[73 rows x 1 columns]

In [ ]:
quarterly